# Домашнее задание №1

**Дедлайны**: 10.09.2019 12:10

Перед сдачей задания необходимо ознакомиться с информацией по 
[ссылке](https://gitlab.com/itmo-scripting-languages/python-2019/blob/master/README.md).

## Задачи

#### 1. Задачи на работу с листами (1.5 балла)
  * `remove_adjacent` (0.5 балла)

     Функция принимает на вход список чисел.
     Возвращает новый список, равный исходному, если бы из него удалили одинаковые смежные числа.
     
  * `linear_merge` (1 балл)

     Объедините два отсортированных списка в один за линейное время.
     В этом задании не нужно итерироваться по элементам (`for i in your_list`) - обращайтесь к элементам листов через индексы.
  
#### 2. Матрицы (2 балла)
  * `matrix_product` (1 балл)

    Написать функцию, вычисляющую произведение двух матриц (матрица - список списков).
    Если матрицы нельзя перемножить, сгенерировать исключение.
  
  * `matrix_pretty_print` (1 балл)

    Функция печатает переданную матрицу в красивом виде.
    Формат вывода определяется вами самостоятельно, степень его красоты определяется преподавателем и отражается на ваших баллах.
    Пример красивого формата:

    ```
    >>> matrix_pretty_print([[11, -4, 6, 123], [12, -9, 2, 5]])
    -------------------------
    |  11 |  -4 |   6 | 123 |
    -------------------------
    |  12 |  -9 |   2 |   5 |
    -------------------------
    ```
    
    Для простоты можете считать, что числа состоят не более, чем из 3 цифр.

#### 3. nl (1 балл)
Написать упрощенный вариант утилиты `nl` - скрипт, который выдает в `stdout` пронумерованные строки из файла.
Если файл не передан, то строка читает строки из `stdin`.
Он должен работать так же, как `nl -b a`.

#### 4. tail (1 балл)
Написать упрощенный вариант утилиты `tail` - скрипт, выводящий в `stdout` последние 10 строк каждого из переданных файлов.
Если передано больше одного файла, то перед обработкой очередного файла необходимо вывести его имя (подробности смотрите в оригинальной утилите `tail`).
Если не передано ни одного файла, то нужно вывести последние 10 строк из `stdin`.

**Считывать весь файл в память запрещается.**

#### 5. wc (1.5 балла)
Написать скрипт, работающий так же, как утилита `wc`, вызванная без дополнительных опций.
Т.е. для каждого переданного файла утилита выводит статистику (3 числа) и имя файла.
Если передано больше одного файла, то в самом конце утилита выводит суммарную статистику (total).
Если ни одного файла не передано, то утилита считывает весь вход и печатает для него статистику без имени.
Обратите внимание на то, что третьим числом `wc` выводит не число символов, а число байт!

#### 6. Словарь (1 балл)
В наших руках оказался англо-латинский словарь, то есть список слов на английском языке и их переводы на латинский язык 
(переводов может быть несколько) в виде строки:
```
"""\
apple - malum, pomum, popula
fruit - baca, bacca, popum
punishment - malum, multa
"""
```

Необходимо реализовать функцию, считывающую словарь из переданной строки, а также функцию, 
создающую из словаря латино-английский, и функцию, выводящую словарь. 

В результате для строки, описанной выше, на экран должно быть выведено:
```
baca - fruit
bacca - fruit
malum - apple, punishment
multa - punishment
pomum - apple
popula - apple
popum - fruit
```

__Для хранения словаря должен использоваться словарь!__

#### 7. Задачи на работу со строками (1 балла)
  * `verbing` (0.5 балла)

     Дана строка. Если ее длина по крайней мере 3, добавьте в конец 'ing', кроме случая, когда строка уже заканчивается на 'ing'.
     В этом случае добавьте в конец 'ly' вместо 'ing'. Если длина стркои меньше 3, верните ее неизменной.
     Функция возвращает строку-результат.
     
  * `not_bad` (0.5 балла)

     Дана строка, найдите первые вхождения подстрок `not` и `bad`.
     Если `bad` следует за `not`, замените всю подстроку `not ... bad` строкой `good`, иначе оставьте строку неизменной.
     Функция возвращает строку-результат.
